Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: "Type theory" gets its name from the fact that every expression has an associated type.
ko: '유형론'은 그것의 이름을 모든 표현은 연관된 유형을 가지고 있다는 사실로부터 갖게 되었습니다.

source: #check Nat → Nat -- type the arrow as "\to" or "\r" #check Nat -> Nat -- alternative ASCII notation #check Nat × Nat -- type the product as "\times" #check Prod Nat Nat -- alternative notation #check Nat → Nat → Nat #check Nat → (Nat → Nat) -- same type as above #check Nat × Nat → Nat #check (Nat → Nat) → Nat -- a "functional" #check Nat.succ -- Nat → Nat #check (0, 1) -- Nat × Nat #check Nat.add -- Nat → Nat → Nat #check Nat.succ 2 -- Nat #check Nat.add 3 -- Nat → Nat #check Nat.add 5 2 -- Nat #check (5, 9).1 -- Nat #check (5, 9).2 -- Nat #eval Nat.succ 2 -- 3 #eval Nat.add 5 2 -- 7 #eval (5, 9).1 -- 5 #eval (5, 9).2 -- 9
ko: #check Nat → Nat --화살표를 쓰기 위해서 "\to"나 "\r"를 치세요. #check Nat -> Nat -- ASCII 표기의 대체표현입니다. #check Nat × Nat -- 곱하기를 쓰기 위해 "\times"를 치세요. #check Prod Nat Nat -- 대체 표현입니다. #check Nat → Nat → Nat #check Nat → (Nat → Nat) -- 위와 같은 유형입니다. #check Nat × Nat → Nat #check (Nat → Nat) → Nat -- "범함수" #check Nat.succ -- Nat → Nat #check (0, 1) -- Nat × Nat #check Nat.add -- Nat → Nat → Nat #check Nat.succ 2 -- Nat #check Nat.add 3 -- Nat → Nat #check Nat.add 5 2 -- Nat #check (5, 9).1 -- Nat #check (5, 9).2 -- Nat #eval Nat.succ 2 -- 3 #eval Nat.add 5 2 -- 7 #eval (5, 9).1 -- 5 #eval (5, 9).2 -- 9

source: #check fun (x : Nat) => x + 5 -- Nat → Nat #check λ (x : Nat) => x + 5 -- λ and fun mean the same thing #check fun x : Nat => x + 5 -- Nat inferred #check λ x : Nat => x + 5 -- Nat inferred
ko: #check fun (x : Nat) => x + 5 -- Nat → Nat #check λ (x : Nat) => x + 5 -- λ 와 fun 같은 의미를 가집니다. #check fun x : Nat => x + 5 -- Nat으로 추론됩니다. #check λ x : Nat => x + 5 -- Nat으로 추론됩니다.

source: (Lean will tell you that sub2 has been defined in terms of an internal auxiliary function, sub2.match_1, but you can print that out too.) Lean uses these auxiliary functions to compile match expressions.
ko: (린은 여러분에게 sub2가 내부의 보조 함수 sub2.match_1에 대해서 정의되었다고 말할 것입니다. 그러나 여러분은 그것도 출력해볼 수 있습니다.) 린은 이 보조 함수를 match 표현식을 컴파일하는데 사용합니다.

source: (Making sense of the type of this function requires an understanding of dependent products, which will be explained below.)
ko: (이 함수의 유형들을 이해하는 것은 아래에서 설명할 의존 곱에 대한 이해가 필요합니다.)

source: (Note that this description is somewhat misleading, in that the arguments to the constructor can appear in any order as long as the dependencies make sense.) The constraints on the universe level of C fall into two cases, depending on whether or not the inductive type is specified to land in Prop (that is, Sort 0).
ko: (그들의 의존성이 성립되는 한 인자가 생성자에 임의의 순서로 나타날 수 있다는 점에서 이 설명은 약간 오해로 이끌 수 있습니다.) C의 세계 수준에서 귀납형이 Prop (즉, Sort 0)에 머무른다고 나타나져 있는지 아닌지에 따라 제약은 두 경우로 나누어 떨어집니다.

source: (The notation +, as we have defined it, associates to the left, so m + n + k is really (m + n) + k.) The hardest part is figuring out which variable to do the induction on.
ko: (+ 기호는 우리가 정의했다시피 왼쪽으로 결합됩니다. 그래서 m + n + k은 사실 (m + n) + k입니다.) 가장 어려운 부분은 어떤 변수에 귀납을 적용할 것인지 알아내는 것 입니다.

# (The symbol ¬ is produced by typing ot or eg.)
source: (The symbol ¬ is produced by typing \not or \neg.)
ko: (기호 ¬은 \not이나 \neg을 치는 것으로 만들어집니다.)

source: (To run these examples, we put them in a namespace called Hidden, so that a name like Bool does not conflict with the Bool in the standard library.
ko: (이 예제를 실행하려면 우리는 Hidden이라는 이름공간에 이들을 두어서 Bool같은 이름이 표준 라이브러리에서의 Bool과 출돌하지 않게 해야 합니다.

source: (You can enter it with \l or use the ascii equivalent, <-.) If brevity is what we are after, both rw and simp can do the job on their own:
ko: (여러분은 이것을 \l을 치거나 아스키 형식 <-을 사용할 수 있습니다.) 우리가 간결함을 추구한다면 rw과simp이 알아서 처리해 줄 것입니다.

source: (fun x => x) :: [] -- In this example, implicit lambda introduction has been disabled because -- we use `@` before `fun` def id2 : {α : Type} → α → α :=
ko: (fun x => x) :: [] -- 우리는 `fun` 앞에 `@`를 쓰기 때문에 -- 이 예제에서 암시적인 람다의 도입은 해제되었습니다. def id2 : {α : Type} → α → α :=

source: -/ #check m -- output: Nat #check n #check n + 0 -- Nat #check m * (n + 0) -- Nat #check b1 -- Bool #check b1 && b2 -- "&&" is the Boolean and #check b1 || b2 -- Boolean or #check true -- Boolean "true" /- Evaluate -/ #eval 5 * 4 -- 20 #eval m + 2 -- 3 #eval b1 && b2 -- false
ko: -/ #check m -- output: Nat #check n #check n + 0 -- Nat #check m * (n + 0) -- Nat #check b1 -- Bool #check b1 && b2 -- "&&"은 불리언 and #check b1 || b2 -- 불리언 or #check true -- 불리언 "true" /- Evaluate -/ #eval 5 * 4 -- 20 #eval m + 2 -- 3 #eval b1 && b2 -- false

source: -/ def m : Nat := 1 -- m is a natural number def n : Nat := 0 def b1 : Bool := true -- b1 is a Boolean def b2 : Bool := false /- Check their types.
ko: -/ def m : Nat := 1 -- m은 자연수입니다. def n : Nat := 0 def b1 : Bool := true -- b1은 불리언입니다. def b2 : Bool := false /- 그들의 유형을 확인합니다.

source: /- Define some constants.
ko: /- 몇 가지 상수를 정의합니다.

source: Automated theorem proving focuses on the "finding" aspect.
ko: 자동화된 정리 증명은 '찾기'에 초점을 둡니다.

source: Axioms and Computation
ko: 공리와 계산(Axioms and Computation)

source: Dependent Type Theory
ko: 의존 유형론(Dependent Type Theory)

source: Formal verification involves the use of logical and computational methods to establish claims that are expressed in precise mathematical terms.
ko: 형식 증명은 정밀한 수학적 항들로 표현된 주장을 세우는데 논리적이고 계산과학적 방법의 사용을 수반합니다.

source: Induction and Recursion
ko: 유도와 재귀(Induction and Recursion)

source: Inductive Types
ko: 귀납형(Inductive Types)

source: Interacting with Lean
ko: 린과 상호작용하기(Interacting with Lean)

source: Introduction
ko: 소개(Introduction)

source: Propositions and Proofs
ko: 명제와 증명(Propositions and Proofs)

source: Quantifiers and Equality
ko: 한정기호와 동등성(Quantifiers and Equality)

source: Record update is another common operation which amounts to creating a new record object by modifying the value of one or more fields in an old one.
ko: 레코드 업데이트는 이전 필드에서 하나 이상의 필드 값을 수정하여 새 레코드 개체를 만드는 것과 같은 또 다른 흔한 연산입니다.

source: Structures and Records
ko: 구조체와 레코드(Structures and Records)

source: TODO: waiting for well-founded support in Lean 4
ko: 할 것: 린4가 지원하는 잘 세워진 식을 대기하기

source: Tactic combinators are operations that form new tactics from old ones.
ko: Tactic combinators은 이전의 전략으로부터 새로운 전략을 만드는 연산자들 입니다.

source: Tactics for Inductive Types below will introduce additional tactics that are specifically designed to make use of inductive types.
ko: 귀납형을 위한 전략 아래에서 귀납형의 사용을 위해 특별히 고안된 추가 전략들을 도입할 것입니다.

source: Tactics
ko: 전략(Tactics)

source: The Conversion Tactic Mode
ko: 전략 모드로 전환(The Conversion Tactic Mode)

source: Theorem Proving in Lean 4
ko: 린4로 하는 정리 증명

source: Type Classes
ko: 유형 클래스(Type Classes)

source: apply <term> is syntax sugar for tactic => apply <term>
ko: apply <term>은 tactic => apply <term>에 대한 문법 설탕입니다.

source: arg i enter the i-th nondependent explicit argument of an application.
ko: arg i는 적용의 i번째 비의존적인 명시적 인수를 입력합니다.

source: args alternative name for congr
ko: args congr의 대체 이름

source: by Jeremy Avigad, Leonardo de Moura, Soonho Kong and Sebastian Ullrich, with contributions from the Lean Community
ko: Jeremy Avigad, Leonardo de Moura, Soonho Kong and Sebastian Ullrich 및 Lean 커뮤니티의 기여자들 저

source: compose also takes a 3rd argument of type α which it uses to invoke the second function (locally named f) and it passes the result of that function (which is type β) as input to the first function (locally named g).
ko: compose는 이는 두 번째 함수(지역적으로 f라 하는)을 호출하는데 사용되기도 하는 유형 α 를 세 번째 인수로 받습니다. 그리고 두 번째 합수는 그 함수의 결과(유형 β의)를 첫 번째 함수(지역적으로 g라 하는)의 입력으로 전달합니다.

source: compose is also very general in that it works over any type α β γ.
ko: compose는 또 아주 일반적이어서 임의의 유형 α β γ에 대해서도 작동합니다.

source: congr creates as many targets as there are (nondependent and explicit) arguments to the current head function (here the head function is multiplication).
ko: congr은 현재 머리 함수 (여기서 머리 함수은 곱셈)에 대한 (비의존적 및 명시적) 인수만큼 많은 대상을 생성합니다.

source: def can take multiple input parameters.
ko: def는 다수의 입력 매개변수를 받을 수 있습니다.

source: done fail if there are unsolved goals.
ko: 미해결 목표가 있으면 done이 실패합니다.

source: enter [1, x, 2, y] iterate arg and intro with the given arguments.
ko: enter [1, x, 2, y] 주어진 인수로 arg 및 intro를 반복합니다.

source: lhs navigates to the left hand side of a relation (here equality), there is also a rhs navigating to the right hand side.
ko: lhs는 관계식의 좌변으로 이동하고(여기서는 등호), 우변으로 이동하는 rhs도 있습니다.

source: simp applies the simplifier to the current goal.
ko: simp는 현재 목표에 단순화기를 적용합니다.

source: skip goes to the next target.
ko: skip는 다음 대상으로 이동합니다.

source: tactic => <tactic sequence> go back to regular tactic mode.
ko: tactic => <tactic sequence>는 보통의 전략 모드로 되돌아갑니다.

source: traceState display the current tactic state.
ko: traceState는 현재 전략 상태를 표시합니다.

source: whnf put term in weak head normal form.
ko: whnf은 항를 약한 머리 정규 형식에 둡니다.

source: Type 1 is then a larger universe of types, which contains Type 0 as an element, and Type 2 is an even larger universe of types, which contains Type 1 as an element.
ko: Type 1는 Type 0를 원소로 갖는 유형들의 더 큰 세계이고 Type 2는 Type 1을 원소로 하는 유형들의 더욱 큰 세계입니다.

source: Section wildcards and overlapping patterns expands on the notion of a wildcard, and Section Inaccessible Patterns explains how you can use implicit arguments in patterns as well.
ko: 와일드카드와 중복된 패턴 섹션은 와일드카드에 대한 개념을 넓히고 접근할 수 없는 패턴 섹션은 여러분이 어떻게 패턴속에서도 암시적인 인수를 사용할 수 있는지 설명합니다.

source: Prop has some special features, but like the other type universes, it is closed under the arrow constructor: if we have p q : Prop, then p → q : Prop.
ko: Prop은 특별한 특징이 있습니다. 하지만 다른 유형 세계처럼, 화살표 생성자로 달성됩니다. 우리가 p q : Prop갖는다면 p → q : Prop입니다.

source: Type is an abbreviation for Type 0:
ko: Type는 Type 0에 대한 약식 표현입니다.

source: <tactics> (or · <tactics>) for structuring proof.
ko: <tactics> (혹은 · <tactics>)

source: A number of identities in Lean's library have been tagged with the [simp] attribute, and the simp tactic uses them to iteratively rewrite subterms in an expression.
ko: Lean의 라이브러리 속 다수의 항등식은 [simp] 속성으로 표식되었습니다. 그리고 simp 전략은 이들을 표현식에서 부분항 다시쓰기로 반복적으로 사용합니다.

source: A calculation can be viewed as a proof as well, and these systems, too, help establish mathematical claims.
ko: 계산도 증명의 관점으로 볼 수 있으며 이런 시스템들도 수학적 진술을 세우는데 도움을 줍니다.

source: A calculational proof is just a chain of intermediate results that are meant to be composed by basic principles such as the transitivity of equality.
ko: 계산 증명은 동등의 전달성과 같은 기본 원리로 구성된 것을 의미하는 중간 단계의 결과를 연결할 뿐입니다.

source: A canonical example is the type Nat of natural numbers:
ko: 표준 예제는 자연수의 Nat유형입니다.

source: A common idiom is to simplify a goal using local hypotheses:
ko: 흔한 관용구는 국부 가정을 사용해 목표를 단순화하는 것입니다.

source: A constructor with multiple arguments introduces conjunctive information: from an element Prod.mk a b of Prod α β we can extract a and b.
ko: 다수의 인수들이 있는 생성자는 결합적인 정보를 가져옵니다. Prod α β의 원소 Prod.mk a b으로부터 우리는 a그리고b를 뽑아낼 수 있습니다.

source: A disadvantage is that Lean does not have enough information to infer the types of the arguments in the expressions trans_r and trans_r hab.
ko: 단점은 린이 표현식 trans_r과 trans_r hab에서 인자의 유형을 추론하기에 충분한 정보가 없다는 것 입니다.

source: A first guess might be Type → α → list α → list α, but, on reflection, this does not make sense: the α in this expression does not refer to anything, whereas it should refer to the argument of type Type.
ko: 첫 번째 추측은 Type → α → list α → list α일지 모릅니다. 그러나 생각해보면 이는 말이 되지 않습니다. 이 식에서 α는 어떤 것도 지칭하지 않으므로 Type 유형을 인수로 지칭해야 합니다.

source: A first thought might be to use the casesOn function:
ko: 첫 고려사항은 casesOn 함수를 사용하는 것입니다.

source: A heartbeat is the number of (small) memory allocations (in thousands), 0 means there is no limit.
ko: 심박수는 (작은) 메모리 할당(천 단위)의 수이고, 0은 제한이 없음을 의미합니다.

source: A list of elements of type α is either the empty list, nil, or an element h : α followed by a list t : List α.
ko: α형 원소의 리스트는 빈 리스트 nil이거나 리스트 t : List α의 다음의 원소 h : α입니다.

source: A more exotic example is given by the definition of the equality type in Lean:
ko: 더 특이한 예제는 린의 동등성 유형의 정의에 의해 제시됩니다.

source: A more interesting example of structural recursion is given by the Fibonacci function fib.
ko: 구조적 재귀의 더 흥미로운 예제는 피보나치 함수 fib로부터 제시됩니다.

source: A mutual inductive definition can also be used to define the notation of a finite tree with nodes labelled by elements of α:
ko: 상호적 재귀 정의는 노드가 α의 원소로 색인된 유한 트리의 기호를 정의하는데도 사용될 수 있습니다.

source: A placeholder with precedence p accepts only notations with precedence at least p in that place.
ko: 우선순위가 p인 자리차지자는 오직 그 자리에 적어도 p 순위인 기호만을 받아들입니다.

source: A proof of p is then simply an object t : p of the right type.
ko: p의 증명은 단순히 t : p 오른쪽 유형의 객체입니다.

source: A proof term is a representation of a mathematical proof; tactics are commands, or instructions, that describe how to build such a proof.
ko: 증명 항는 수학적 증명의 표현입니다. 전술은 그러한 증명를 구축하는 방법을 설명하는 명령 또는 지침입니다.

source: A sequencing combinator is already implicit in the by block:
ko: 순차 조합자는 by 블럭에 이미 암시적으로 있습니다.

source: A type, like Prod, that has only one constructor is purely conjunctive: the constructor simply packs the list of arguments into a single piece of data, essentially a tuple where the type of subsequent arguments can depend on the type of the initial argument.
ko: Prod 같이 한 생성자만 갖고 있는 유형은 순수하게 결합적입니다. 생성자는 단순히 인수 리스트를 하나의 데이터 조각으로 뭉칩니다. 본질적으로 순차적인 인수들의 유형인 튜플은 초기 인수의 유형에 의존할 수 있습니다.

source: About Lean
ko: 린에 대해서

source: About this Book
ko: 이 책에 대하여

source: According to its definition, Acc r x is equivalent to ∀ y, r y x → Acc r y.
ko: 이것의 정의에 따르면 Acc r x는 ∀ y, r y x → Acc r y과 동등합니다.

source: Acknowledgments
ko: 감사의 말

source: Actually, Lean compiles the match expressions using a definition based on Eq.rec.
ko: 실제로, 린은 match 표현식을 Eq.rec에 기반한 정의를 사용해 컴파일합니다.

source: Actually, the definition above is expanded to
ko: 실제로 위 정의는 다음과 같이 확장됩니다.

source: Add support for hiding lines in other languages #1339
ko: 다른 언어 #1339에서 선을 숨기는 것의 지원을 추가하기.

source: Adding such extra information can improve the clarity of a proof and help detect errors when writing a proof.
ko: 그런 추가 정보를 더하는 것은 증명의 명확성을 개선하고 증명을 작성할 때 오류를 감지하도록 돕습니다.

source: Adding the local modifier restricts the scope:
ko: 범위를 제한하기 위해 local 수정자를 추가하기

source: After the first two lines, we have h : m < n ∨ m ≥ n as a hypothesis, and we simply do cases on that.
ko: 첫 두 줄 이후에 우리는 h : m < n ∨ m ≥ n을 가정으로 갖습니다. 그리고 우리는 단순히 이에 대해 경우를 나눕니다.

source: After the initial command name describing the operator kind (its "fixity"), we give the parsing precedence of the operator preceded by a colon :, then a new or existing token surrounded by double quotes (the whitespace is used for pretty printing), then the function this operator should be translated to after the arrow =>.
ko: 연산자 종류를 설명하는 초기 명령 이름 뒤에 (해당 "결합위치"), 콜론 :으로 앞서는 연산자의 구문분석 우선순위를 줍니다. 그 뒤 새로운 혹은 존재하는 토큰(깔끔한 출력을 위해 공백기호가 사용됨)은 큰 따옴표로 둘러쌓입니다. 그러면 이 연산자의 기능은 뒤따르는 화살표 =>로 번역되어야 합니다.

source: Algorithmically speaking, the Decidable type class can be used to infer a procedure that effectively determines whether or not the proposition is true.
ko: 알고리즘적으로 말하자면 Decidable 유형 클래스는 명제가 참인지 여부를 효과적으로 결정하는 절차를 추론하는데 사용될 수 있습니다.

source: All that has changed are the braces around α : Type u in the declaration of the variables.
ko: 바뀐 것이라곤 변수 선언에서 α : Type u 주위의 괄호뿐입니다.

source: All the examples of pattern matching we considered in :numref:pattern_matching can easily be written using cases_on and rec_on.
ko: 패턴 매칭의 모든 예제로부터 우리는 :numref:패턴 매칭에서 cases_on과 rec_on를 사용해 쉽게 쓸 수 있음을 고려했습니다.

source: All this is also available to rewrite an hypothesis h from the local context using conv at h.
ko: 이 모든 것은 conv at h를 사용하여 지역 상황에서 가정 h를 다시쓰기 하는 데에도 이용할 수 있습니다.

source: All you need to do is to provide a label, and generalize uses it to store the assignment in the local context:
ko: 여러분이 해야할 것은 레이블을 제공하는 것과 generalize가 그 레이블을 지역 상황에 할당물을 저장하는데 사용하도록 하는 것입니다.

source: Alternatively, you can define tactic blocks usind curly braces and semicolons.
ko: 대신 여러분은 전략 블럭을 중괄호와 세미콜론을 사용해 전략 블록을 정의할 수 있습니다.

source: Although the names of theorems and definitions have to be unique, the aliases that identify them do not.
ko: 로 확장됩니다. 정리와 정의의 이름은 고유하여야 함에도 별명은 그들을 식별하는 별명은 그렇지 않습니다.

source: Although we love this feature and use it extensively when implementing Lean, we realize some users may feel uncomfortable with it.
ko: 우리가 이 기능을 좋아하고 린을 구현할 때 광범위하게 이를 사용했지만 우리는 어떤 사용자들이 이것에 대해 불편하게 느끼는 것을 깨달았습니다.

source: An element of Option β is either none or of the form some b, for some value b : β.
ko: Option β의 원소는 none이거나 어떤 값 b : β에 대한 some b꼴 입니다.

source: An "axiom" would be a constant of such a type.
ko: "공리"는 그러한 유형의 상수입니다.

source: An arbitrary inductive type can include both features, by having any number of constructors, each of which takes any number of arguments.
ko: 임의의 귀납형은 다수의 생성자를 갖거나 각각이 다수의 인수를 받게 함으로써 양쪽의 특징을 모두 포함할 수 있습니다.

source: An element of Inhabited α is simply a witness to the fact that there is an element of α.
ko: Inhabited α의 원소는 단지 α의 원소가 있다는 사실에 대한 증인입니다.

source: An element of the class Inhabited a is simply an expression of the form Inhabited.mk x, for some element x : a.
ko: 클래스 Inhabited a의 원소는 단순히 어떤 원소 x : a에 대한 Inhabited.mk x꼴의 표현식입니다.

source: An expression like id or List.nil is said to be polymorphic, because it can take on different meanings in different contexts.
ko: 다른 맥락에서 다른 의미를 가질 수 있기 때문에 id 나 List.nil 같은 표현식을 다형적이라 합니다.

source: An inductive family is an indexed family of types defined by a simultaneous induction of the following form:
ko: 귀납군은 다음 형태를 따르는 동시 재귀로 정의되는 유형의 색인된 군입니다.

source: And
ko: 논리곱

source: And, indeed, we do: the standard library defines WellFounded.fix, which serves exactly that purpose.
ko: 그리고 물론 우리는 이를 갖습니다. 표준 라이브러리는 바로 그 목적을 담당하는 WellFounded.fix를 정의합니다.

source: And, indeed, it does:
ko: 그리고 당연히 그럽니다.

source: Another good example of a recursive definition is the list append function.
ko: 재귀적 정의의 또 다른 좋은 예제는 리스트 append 함수입니다.

source: Another tactic that is sometimes useful is the revert tactic, which is, in a sense, an inverse to intro.
ko: 때떄로 유용한 또 다른 전략은 revert는 intro의 역방향 전략입니다.

source: Any text between /- and -/ constitutes a comment block that is ignored by Lean.
ko: /-과 -/ 사이의 모든 글은 린에게 무시하라고 가리키는 주석을 만듭니다.

source: Application can be viewed as an "elimination rule," showing how to "eliminate" or use an implication in a proof.
ko: 적용은 어떻게 "제거"하는지 증명에서 함의를 사용하는지를 보여주는 "제거 규칙"으로 볼 수 있습니다.

source: Applying it again yields succ (succ zero) : Nat, and so on.
ko: 이를 다시 적용하여 succ (succ zero) : Nat을 얻습니다. 그리고 계속됩니다.

source: Applying it to zero yields succ zero : Nat.
ko: 이를 zero에 적용하여succ zero : Nat을 얻습니다.

source: Applying the theorem t1 : p → q → p to the fact hp : p that p is true yields the theorem t1 hp : q → p.
ko: 정리t1 : p → q → p를 사실 hp : p에 적용하는 것은 p가 참임을 정리t1 hp : q → p을 얻습니다.

source: Applying this to the "hypothesis" hab : r a b, we get a proof of the implication r b c → r a c.
ko: 이를 "가정" hab : r a b에 적용함으로써 우리는 함의 r b c → r a c의 증명을 얻습니다.

source: Architectures like SMT ("satisfiability modulo theories") combine domain-general search methods with domain-specific procedures.
ko: SMT(Satisfiability Modulo Theories)같은 구조는 영역-일반 탐색법을 영역-특정 절차와 결합했습니다.

source: As a result, we can also prove the theorem as follows:
ko: 결론적으로 다음과 같이 정리를 증명할 수도 있습니다.

source: As a convenience, pattern-matching has been integrated into tactics such as intro and funext.
ko: 편리하기에 패턴 매칭은 intro와 funext 같은 전략에 합쳐졌습니다.

source: As a final example, we observe that Ackermann's function can be defined directly, because it is justified by the well foundedness of the lexicographic order on the natural numbers.
ko: 마지막 예제로 우리는 Ackermann 함수가 직접적으로 정의되는 것을 관찰합니다. 왜냐하면 이것은 자연수에 대해 사전적 순서로 잘 세워짐으로 정당활 될 수 있기 때문입니다.

source: As a first example, let us prove example (a b c : Nat) : a * (b * c) = a * (c * b) (examples in this file are somewhat artificial since other tactics could finish them immediately).
ko: 첫 번째 예로서 (a b c : Nat) : a * (b * c) = a * (c * b) 예제를 증명해 봅시다. (다른 전술로 이 예제를 즉시 끝낼 수 있기에 이것은 다소 인위적입니다.)

source: As a further exercise, we suggest defining boolean operations and, or, not on the Bool type, and verifying common identities.
ko: 추가 연습으로 우리는 Bool형에 불리언연산 and, or, not을 정의하는 것을 제안합니다. 그리고 일반적인 항등식을 확인해보세요.

source: As a notational convention, we give the universal quantifier the widest scope possible, so parentheses are needed to limit the quantifier over x to the hypothesis in the example above.
ko: 기호 규약으로써 우리는 전칭 한정기호에게 가능한 가장 넓은 범위를 줍니다. 그래서 위의 예제에서 가정의 x에만 한정사를 제한하도록 괄호가 필요합니다.

source: As a result, Eq.subst doesn't always do what you want it to.
ko: 그러므로 Eq.subst은 여러분이 원하는 대로 항상 행하지 못합니다.

source: As a result, given h : p ∧ q, we can write h.left for And.left h and h.right for And.right h.
ko: 결과적으로 h : p ∧ q라면 우리는 h.left를 And.left h을 나타내는데 그리고 h.right 를 And.right h을 나타내는데 쓸 수 있습니다.

source: As a result, most of the examples we present here work "out of the box."
ko: 그 결과 우리가 여기에 소개하는 대부분의 예제는 상식 밖의 것입니다.

source: As a result, some nontrivial identities can be proved by reflexivity:
ko: 결과적으로 어떤 비직관적인 항등식들이 대칭성으로부터 증명됩니다.

source: As a result, the next argument to the recursor specifies a value for f (succ n) in terms of n and f n.
ko: 그 결과 재귀자에 대한 다음 인수는 n과 f n에 대해서 f (succ n)에 대한 값을 명시합니다.

source: As a result, the introduction of the connective Implies is entirely redundant: we can use the usual function space constructor p → q from dependent type theory as our notion of implication.
ko: 결과적으로 연결사 Implies의 도입은 완전히 중복됩니다. 그래서 우리는 의존 유형론의 함의에 대한 개념으로써 종종 함수 공간 생성자p → q를 사용할 수 있습니다.

source: As a result, the type class supports such computational definitions when they are possible while at the same time allowing a smooth transition to the use of classical definitions and classical reasoning.
ko: 결과적으로 유형 클래스는 그들이 가능할 때 그런 계산적 정의를 지원하는 동시에 고전적 정의와 고전 추론의 사용으로 원활히 넘어가는 것을 허용합니다.

source: As a theorem of propositional logic, what does t2 say?
ko: 명제 논리의 정리로써 t2가 말하는 것은 무엇인가요?

source: As an example, the following settings yield much longer output:
ko: 예제로 다음 설정은 훨씬 더 긴 출력을 만듭니다.

source: As an exercise, prove the following:
ko: 연습으로 다음을 증명하세요.

source: As an exercise, try defining default instances for other types, such as List and Sum types.
ko: 연습으로 List형과 Sum형 같은 다른 유형에 대한 기본 개체를 정의해보세요.

source: As an exercise, try to understand why the definition of foo below type checks, but the definition of bar does not.
ko: 연습으로 아래 유형 확인에서 foo의 정의가 왜 그런지 그러나 bar의 정의는 그렇지 않은지 이해하려고 해 보세요.

source: As an exercise, you might try proving the converse, that is, showing that em can be proved from dne.
ko: 연습으로 여러분은 역을 증명해보세요, 즉 em이 dne로부터 증명될 수 있음을 보이세요.

source: As an exercise, you should think about what the introduction and elimination rules for these types do.
ko: 연습으로 여러분은 이 유형들에 대한 도입과 제거 규칙이 하는 것에 대해 생각해봐야 합니다.

source: As another example, here is how we can express the fact that a relation, r, is transitive:
ko: 또 다른 예제처럼 여기서 관계 r이 추이적이라는 사실을 어떻게 표현할지를 보여줍니다.

source: As another example, let us consider the composition function discussed in the last chapter, now with propositions instead of types.
ko: 또 다른 예로써 지금은 유형 대신 명제로 지난 장에서 논한 합성함수를 고려해봅시다.

source: As before, the recursor for Nat is designed to define a dependent function f from Nat to any domain, that is, an element f of (n : nat) → motive n for some motive : Nat → Sort u.
ko: 전처럼 Nat에 대한 재귀자는 의존함수 f를 Nat에서 임의의 영역으로 정의하도록 설계되었습니다. 즉, 어떤 motive : Nat → Sort u에 대해 (n : nat) → motive n의 원소가 f입니다.

source: As described in Chapter Inductive Types, inductive data types can depend on parameters.
ko: 재귀형 장에서 설명했다시피 재귀 데이터형은 매개변수에 의존합니다.

source: As exercises, we encourage you to develop a notion of composition for partial functions from α to β and β to γ, and show that it behaves as expected.
ko: 연습으로 우리는 여러분이 α에서β까지 그리고 β to γ까지 부분 함수에 대한 합성의 개념을 만들도록 권장합니다. 그리고 그것이 기대한 바처럼 행동하는 것을 보여주세요.
